welcome_text = """<b>Добро пожаловать в VRP VPN ⚡️</b>

Быстрый, стабильный и полностью приватный VPN.

<b>Что вы получите</b>:
• Мгновенное подключение  
• Защиту в Wi-Fi сетях  
• Полную анонимность (XRAY VLESS REALITY)  
• Поддержку 24/7

<b>📞 Помощь:  </b>
Если возникли вопросы или сложности — пишите менеджеру: @difuzick  

<b>Начните с выбора действия ⬇️</b>
"""

help_text = """
🆘 Помощь

/start — Перезапустить  
/help — Это меню  
/key — Показать ключ  
/gift — 10 дней бесплатно 🎁  
/buy — Купить ключ  
/manual — Полная инструкция
"""

manual_text = """<b>📲 Выберите приложение для установки:</b>
• <b>Windows / Linux:</b> Hiddify, Nekoray  
• <b>Android:</b> V2RayTun  
• <b>iOS:</b> Hiddify, V2Box(есть реклама в приложении)

Наше фирменное приложение скоро выйдет 🔧 
"""

gift_text = """
🎁 <b>Получить пробный период!</b>

Ваш пробный период активирован!  
<b>10 дней бесплатного доступа начнутся после первого подключения.</b>

1) Скопируйте VPN-ключ ниже  
2) Вставьте в приложение  
3) Подключайтесь и пользуйтесь 🔐
"""


key_text = """
<b>🔑 Вот ваш VPN-ключ!</b>

Ниже находится ваш персональный ключ для подключения.  
Открыв её, вы сможете удобно скопировать ключ в текстовом виде или воспользоваться <b>QR-кодом</b> 📱 — что особенно удобно для телефона.

Если вы используете сторонние приложения (Hiddify, V2RayTun и др.), просто вставьте ключ туда — и вы сразу будете подключены 🌍

Наше приложение пока что находиться в разработке 🛠️  

<b>Ваш ключ:</b>
"""
buy_text = """
<b>💳 Покупка VPN-ключа</b>

Выберите подходящий тариф и получите <b>моментальный доступ</b> к надёжному и стабильному VPN-сервису.  
После оплаты ключ автоматически активируется и будет готов к использованию 🔥

<b>📦 Доступные тарифы:</b>

• <b>7 дней</b> — <b><i><s>99 ₽</s></i> - 75 ₽</b>
Идеально, чтобы протестировать сервис перед покупкой большого периода.

• <b>30 дней</b> — <b><i><s>199 ₽</s></i> - 99 ₽</b>
Оптимальный вариант для стабильного и безопасного использования VPN каждый день.

• <b>90 дней</b> — <b><i><s>500 ₽</s></i> - 249 ₽</b>
Лучшее соотношение цены и качества. Более выгодно, чем покупать по месяцам.

• <b>180 дней</b> — <b><i><s>950 ₽</s></i> - 449 ₽</b>
Максимальная экономия при длительном использовании.

<b>💰 Оплата:</b>  
Мы используем официальный платёжный сервис, который обеспечивает быстрые и безопасные транзакции.  
После нажатия на тариф — вы сразу перенаправитесь на страницу покупки.

<b>📞 Помощь:</b>  
Если возникли вопросы или сложности — пишите менеджеру: <b>@difuzick</b>  
Мы всегда готовы помочь ❤️
"""






