welcome_text = """<b>Добро пожаловать в ваш персональный VPN-сервис! 🌐 </b> 🌐  
Мы создаём безопасный, быстрый и стабильный инструмент, который обеспечивает <b>защиту вашей приватности даже при нестабильном интернете</b> ⚡

📌 <b>Что мы предлагаем:</b>
• <b>Повышение fps в играх.</b>
• <b>Мгновенное подключение</b> — получите рабочую конфигурацию за секунды.  
• <b>Полная конфиденциальность</b> — максимальная анонимность благодаря XRAY VLESS REALITY и современному шифрованию.  
• <b>Защита данных</b> — безопасность в публичных Wi-Fi сетях и защита от перехвата трафика. 
• <b>Поддержка</b> — мы всегда рядом - <b>@difuzick</b>

📱 <i>Наше приложение <b>VRP VPN</b> Client сейчас в разработке</i> 🛠️  
Но вы можете пользоваться аналогами — 
Для ПК: Hiddify
Для IOS: Nekoray
Для Android: V2RayNG 
и другими клиентами которые поддерживают протокол Xray Vless Reality

👣 <b>Как начать:</b>
1. Нажмите /start  
2. Прочтите инструкцию и материалы  
3. Активируйте <b>10-дневный пробный ключ</b> командой /gift 🎁
4. Подключайтесь и обеспечивайте свою онлайн-безопасность!

<b>Команды:</b>  
/start — Перезапустить бота  
/help — Помощь  
/key — Посмотреть ключ  
/gift — Получить пробный период  
/buy — Купить ключ  
/manual — Полная инструкция  
"""

help_text = """
🆘 Меню помощи

Доступные команды:
/start - Перезапустить бота
/help - Показать это меню
/key - Посмотреть свой ключ
/gift - Получить 10-дневный пробный период 🎁  
/buy - Купить ключ для VPN
/manual - Полная инструкция по экспулотации
"""

manual_text = """<b>🎉 Добро пожаловать в раздел инструкции!</b>

Мы рады помочь вам настроить VPN, который обеспечит <b>стабильную защиту данных и приватность даже при нестабильном интернете</b> 🔥

<b>1) 🔑 Ваш VPN-ключ</b>

<b>1.1) Проверить ключ</b>  
Используйте команду <code>/key</code>, чтобы увидеть и скопировать ваш доступ.

<b>1.2) Получить пробный ключ</b> 🎁  
Команда /gift выдаёт бесплатный доступ на 10 дней.

<b>1.3) Купить ключ</b> 💰  
Команда <code>/buy</code> ведёт на наш официальный платёжный сервис.

<b>2) 📲 Установка приложений</b>

Наше приложение <b>ещё в разработке</b> 🛠️  
Но вы можете использовать популярные аналоги:

<b>Windows / Linux:</b> Hiddify, Nekoray  
<b>Android:</b> V2RayNG  
<b>iOS:</b> Streisand  

Просто вставьте ключ — и вы сразу защищены 🚀  
Ваш трафик будет шифроваться протоколом REALITY для максимальной приватности.

<b>❓ Нужна помощь?</b>  
Мы всегда готовы подсказать, настроить и решить любую проблему ❤️  
Напишите менеджеру: <b>@difuzick</b>

Приятного пользования! ✨  
"""

gift_text = """🎁 <b>Вы активировали ваш пробный период!</b>

<b>Поздравляем!</b> Вы активировали пробный ключ на 10 дней, который предоставляет полный и бесплатный доступ к нашему VPN-сервису.

<b>Важно:</b> ⏳  
Отсчёт пробного периода <u>начнётся только после вашего первого подключения к VPN</u> через приложение.  
Ключ активируется, когда вы действительно начнёте пользоваться сервисом.

Чтобы воспользоваться подарком:

1. <b>Получите ключ</b> 🔑  
   Скопируйте ссылку и вставьте в приложение из списка /manual

2. <b>Настройте подключение</b> ⚙️  
   Наше приложение пока что находится в разработке 🛠️  
   Но вы можете использовать аналоги — смотрите /manual.

3. <b>Активируйте ключ</b> 🚀  
   Просто вставьте его в приложение — и ваше соединение будет защищено.

Если у вас возникнут вопросы — наша команда всегда готова помочь. Просто напишите нам: <b>@difuzick</b>

Приятного использования! ✨
"""


key_text = """
<b>🔑 Вот ваш VPN-ключ!</b>

Ниже находится ваш персональный ключ для подключения.  
Открыв её, вы сможете удобно скопировать ключ в текстовом виде или воспользоваться <b>QR-кодом</b> 📱 — что особенно удобно для телефона.

Если вы используете сторонние приложения (Hiddify, V2RayNG и др.), просто вставьте ключ туда — и вы сразу будете подключены 🌍

Наше приложение пока что находиться в разработке 🛠️  

<b>Ваш ключ:</b>
"""

buy_text = """
<b>💳 Покупка VPN-ключа</b>

Выберите подходящий тариф и получите <b>моментальный доступ</b> к надёжному и стабильному VPN-сервису.  
После оплаты ключ автоматически активируется и будет готов к использованию 🔥

<b>📦 Доступные тарифы:</b>

• <b>7 дней</b> — <b><i><s>75 ₽</s></i> - 49 ₽</b>
Идеально, чтобы протестировать сервис перед покупкой большого периода.

• <b>30 дней</b> — <b><i><s>199 ₽</s></i> - 99 ₽</b>
Оптимальный вариант для стабильного и безопасного использования VPN каждый день.

• <b>90 дней</b> — <b><i><s>500 ₽</s></i> - 249 ₽</b>
Лучшее соотношение цены и качества. Более выгодно, чем покупать по месяцам.

• <b>180 дней</b> — <b><i><s>950 ₽</s></i> - 449 ₽</b>
Максимальная экономия при длительном использовании.

<b>💰 Оплата:</b>  
Мы используем официальный платёжный сервис, который обеспечивает быстрые и безопасные транзакции.  
После нажатия на тариф — вы сразу перенаправитесь на страницу покупки.

<b>📞 Помощь:</b>  
Если возникли вопросы или сложности — пишите менеджеру: <b>@difuzick</b>  
Мы всегда готовы помочь ❤️
"""
