welcome_text = """<b>Добро пожаловать в ваш VPN! 🌐</b>

Мы даём быстрый, стабильный и полностью приватный интернет даже при слабой связи.

<b>Что вы получите:</b>
• Повышение FPS в играх  
• Мгновенное подключение  
• Полная анонимность (XRAY VLESS REALITY)  
• Защита в публичных Wi-Fi  
• Поддержка — @difuzick

<b>Приложение в разработке</b>, пока используйте:  
ПК — Hiddify  
iOS — Nekoray  
Android — V2RayNG  
(поддержка Xray Vless Reality)

<b>Как начать:</b>  
1. /start  
2. Ознакомиться с инструкцией  
3. /gift — получить 10 дней бесплатно  
4. Подключиться и пользоваться

<b>Команды:</b>  
/start — Перезапуск  
/help — Помощь  
/key — Ваш ключ  
/gift — Пробный период  
/buy — Купить ключ  
/manual — Инструкция
"""

help_text = """
🆘 Помощь

/start — Перезапустить  
/help — Это меню  
/key — Показать ключ  
/gift — 10 дней бесплатно 🎁  
/buy — Купить ключ  
/manual — Полная инструкция
"""

manual_text = """<b>🎉 Добро пожаловать в раздел инструкции!</b>

Мы рады помочь вам настроить VPN, который обеспечит <b>стабильную защиту данных и приватность даже при нестабильном интернете</b> 🔥

<b>1) 🔑 Ваш VPN-ключ</b>

<b>1.1) Проверить ключ</b>  
Используйте команду <code>/key</code>, чтобы увидеть и скопировать ваш доступ.

<b>1.2) Получить пробный ключ</b> 🎁  
Команда /gift выдаёт бесплатный доступ на 10 дней.

<b>1.3) Купить ключ</b> 💰  
Команда <code>/buy</code> ведёт на наш официальный платёжный сервис.

<b>2) 📲 Установка приложений</b>

Наше приложение <b>ещё в разработке</b> 🛠️  
Но вы можете использовать популярные аналоги:

<b>Windows / Linux:</b> Hiddify, Nekoray  
<b>Android:</b> V2RayNG  
<b>iOS:</b> Streisand  

Просто вставьте ключ — и вы сразу защищены 🚀  
Ваш трафик будет шифроваться протоколом REALITY для максимальной приватности.

<b>❓ Нужна помощь?</b>  
Мы всегда готовы подсказать, настроить и решить любую проблему ❤️  
Напишите менеджеру: <b>@difuzick</b>

Приятного пользования! ✨  
"""

gift_text = """
🎁 <b>Пробный период активирован!</b>

Вы получили 10 дней бесплатного доступа.  
Отсчёт начнётся после первого подключения к VPN.

Как использовать:  
1. Получите ключ через /key  
2. Вставьте его в приложение (список — /manual)  
3. Подключайтесь и пользуйтесь 🔐

Есть вопросы? Пишите: @difuzick  
Приятного использования! ✨

"""


key_text = """
<b>🔑 Вот ваш VPN-ключ!</b>

Ниже находится ваш персональный ключ для подключения.  
Открыв её, вы сможете удобно скопировать ключ в текстовом виде или воспользоваться <b>QR-кодом</b> 📱 — что особенно удобно для телефона.

Если вы используете сторонние приложения (Hiddify, V2RayNG и др.), просто вставьте ключ туда — и вы сразу будете подключены 🌍

Наше приложение пока что находиться в разработке 🛠️  

<b>Ваш ключ:</b>
"""

buy_text = """
<b>💳 Покупка VPN-ключа</b>

Выберите подходящий тариф и получите <b>моментальный доступ</b> к надёжному и стабильному VPN-сервису.  
После оплаты ключ автоматически активируется и будет готов к использованию 🔥

<b>📦 Доступные тарифы:</b>

• <b>7 дней</b> — <b><i><s>99 ₽</s></i> - 75 ₽</b>
Идеально, чтобы протестировать сервис перед покупкой большого периода.

• <b>30 дней</b> — <b><i><s>199 ₽</s></i> - 99 ₽</b>
Оптимальный вариант для стабильного и безопасного использования VPN каждый день.

• <b>90 дней</b> — <b><i><s>500 ₽</s></i> - 249 ₽</b>
Лучшее соотношение цены и качества. Более выгодно, чем покупать по месяцам.

• <b>180 дней</b> — <b><i><s>950 ₽</s></i> - 449 ₽</b>
Максимальная экономия при длительном использовании.

<b>💰 Оплата:</b>  
Мы используем официальный платёжный сервис, который обеспечивает быстрые и безопасные транзакции.  
После нажатия на тариф — вы сразу перенаправитесь на страницу покупки.

<b>📞 Помощь:</b>  
Если возникли вопросы или сложности — пишите менеджеру: <b>@difuzick</b>  
Мы всегда готовы помочь ❤️
"""
