welcome_text = """<b>Добро пожаловать в VRP VPN ⚡️</b>

Быстрый, стабильный и полностью приватный VPN.

<b>Что вы получите</b>:
• Мгновенное подключение  
• Защиту в Wi-Fi сетях  
• Полную анонимность (XRAY VLESS REALITY)  
• Поддержку 24/7

<b>📞 Помощь:  </b>
Если возникли вопросы или сложности — пишите менеджеру: @difuzick  

<b>Начните с выбора действия ⬇️</b>
"""

help_text = """
🆘 Помощь

/start — Перезапустить  
/help — Это меню  
/key — Показать ключ  
/gift — 10 дней бесплатно 🎁  
/buy — Купить ключ  
/manual — Полная инструкция
"""

manual_text = """<b>📲 Выберите приложение для установки:</b>
<b>Windows / Linux:</b> Hiddify, Nekoray  
<b>Android:</b> V2RayTun  
<b>iOS:</b> Hiddify, V2Box(есть реклама в приложении)

Наше фирменное приложение скоро выйдет 🔧

Просто вставьте ключ — и вы сразу защищены 🚀  

<b>❓ Нужна помощь?</b>  
Мы всегда готовы подсказать, настроить и решить любую проблему ❤️  
Напишите менеджеру: <b>@difuzick</b>

Приятного пользования! ✨  
"""

gift_text = """
🎁 <b>Получить пробный период!</b>

Ваш пробный период активирован!  
<b>10 дней бесплатного доступа начнутся после первого подключения.</b>

1) Скопируйте VPN-ключ ниже  
2) Вставьте в приложение  
3) Подключайтесь и пользуйтесь 🔐
"""


key_text = """
<b>🔑 Вот ваш VPN-ключ!</b>

Ниже находится ваш персональный ключ для подключения.  
Открыв её, вы сможете удобно скопировать ключ в текстовом виде или воспользоваться <b>QR-кодом</b> 📱 — что особенно удобно для телефона.

Если вы используете сторонние приложения (Hiddify, V2RayTun и др.), просто вставьте ключ туда — и вы сразу будете подключены 🌍

Наше приложение пока что находиться в разработке 🛠️  

<b>Ваш ключ:</b>
"""

key_type_text = """
<b>Выберите тип ключа:</b>

🎁 Пробный — 10 дней бесплатно  
💳 Оплаченный — если вы уже купили

<b>📞 Помощь:</b>  
Если возникли вопросы или сложности — пишите менеджеру: <b>@difuzick</b>  
Мы всегда готовы помочь ❤️
"""




