welcome_text = """<b>Добро пожаловать в VRP VPN ⚡️</b>

Быстрый, стабильный и полностью приватный VPN.

<b>Что вы получите</b>:
• Мгновенное подключение  
• Защиту в Wi-Fi сетях  
• Полную анонимность (XRAY VLESS REALITY)  
• Поддержку 24/7

<b>📞 Помощь:  </b>
Если возникли вопросы или сложности — пишите менеджеру: @difuzick  

<b>Начните с выбора действия ⬇️</b>
"""

help_text = """
🆘 Помощь

/start — Перезапустить  
/help — Это меню  
/key — Показать ключ  
/gift — 10 дней бесплатно 🎁  
/buy — Купить ключ  
/manual — Полная инструкция
"""

manual_text = """<b>📲 Выберите приложение для установки:</b>
• <b>Windows / Linux:</b> Hiddify, Nekoray  
• <b>Android:</b> V2RayTun  
• <b>iOS:</b> Hiddify, V2Box(есть реклама в приложении)

Наше фирменное приложение скоро выйдет 🔧 

<b>Выберите платформу для получения инструкции по установке</b>
"""

gift_text = """
🎁 <b>Получить пробный период!</b>

Ваш пробный период активирован!  
<b>10 дней бесплатного доступа начнутся после первого подключения.</b>

1) Скопируйте VPN-ключ ниже  
2) Вставьте в приложение  
3) Подключайтесь и пользуйтесь 🔐
"""


key_text = """
<b>🔑 Вот ваш VPN-ключ!</b>

Ниже находится ваш персональный ключ для подключения.  
Открыв её, вы сможете удобно скопировать ключ в текстовом виде или воспользоваться <b>QR-кодом</b> 📱 — что особенно удобно для телефона.

Если вы используете сторонние приложения (Hiddify, V2RayTun и др.), просто вставьте ключ туда — и вы сразу будете подключены 🌍

Наше приложение пока что находиться в разработке 🛠️  

<b>Ваш ключ:</b>
"""
buy_text = """
<b>💳 Покупка VPN-ключа</b>

📦 <b>Выберите подходящий тариф:</b>

• <b>7 дней</b> — <b><i><s>99 ₽</s></i> - 75 ₽</b>

• <b>30 дней</b> — <b><i><s>199 ₽</s></i> - 99 ₽</b>

• <b>90 дней</b> — <b><i><s>500 ₽</s></i> - 249 ₽</b>

• <b>180 дней</b> — <b><i><s>950 ₽</s></i> - 449 ₽</b>

 Оплата:  
<b>🛡Оплата происходит на защищённом сайте🛡 
💰После оплаты ключ придёт автоматически💰</b>

<b>📞 Помощь:</b>  
Если возникли вопросы или сложности — пишите менеджеру: <b>@difuzick</b>  
Мы всегда готовы помочь ❤️
"""

pc_manual_text = """
💻 <b>PC</b>

<b>▶ Hiddify</b>
    1. Скопируйте свой ключ (узнать можно через кнопку <b>🔑 Мои ключи</b>).
    2. Установите приложение <b>Hiddify</b> (здесь должна быть ссылка).
    3. Откройте приложение и нажмите <b>+</b> → <b>Добавить из буфера обмена</b>.

После этого нажмите кнопку подключения и пользуйтесь свободным интернетом! 🚀

<b>▶ Nekoray (для продвинутых пользователей)</b>
    1. Скопируйте свой ключ (узнать можно через кнопку <b>🔑 Мои ключи</b>).
    2. Скачайте <b>Nekoray</b> (ссылка).
    3. Нажмите правой кнопкой мыши по пустой области.
    4. Выберите <b>Add profile from clipboard</b>.
    5. Профиль появится в списке — нажмите <b>Start</b>.
"""

android_manual_text = """
📱 <b>Android — V2RayTun</b>

    1. Скопируйте свой ключ (узнать можно через кнопку <b>🔑 Мои ключи</b>).
    2. Установите <b>V2RayTun</b> из Google Play или APK.
    3. Откройте приложение и нажмите <b>+</b> → <b>Import config from Clipboard</b> (или через QR-код).
    4. Включите подключение — готово! 🚀
"""

ios_manual_text = """
🍎 <b>iOS — Hiddify / V2Box</b>

<b>▶ Hiddify (iPhone/iPad)</b>
    1. Скопируйте свой ключ (узнать можно через кнопку <b>🔑 Мои ключи</b>).
    2. Установите <b>Hiddify</b> из App Store.
    3. Нажмите <b>Import</b>.
    4. Вставьте ссылку или сканируйте QR-код.
    5. Включите профиль через переключатель.

<b>▶ V2Box</b> <i>(есть реклама)</i>
    1. Скопируйте свой ключ (узнать можно через кнопку <b>🔑 Мои ключи</b>).
    2. Установите <b>V2Box</b> из App Store.
    3. Нажмите <b>Add Profile</b>.
    4. Импортируйте ссылкой или QR-кодом.
    5. Активируйте VPN.
"""
